app/views/articles/show.html.erb

        <li>
          <small><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %></small>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 1