app/controllers/articles_controller.rb

  def index
    # 데이터베이스에서 모든 article을 가져온다.
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def create
    debugger
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save
---
SELECT  `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('this is second article', 'hello guys', '2019-01-09 11:14:10', '2019-01-09 11:14:10', 1)