app/controllers/articles_controller.rb

SELECT  `articles`.* FROM `articles` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles`
---
  def index
    # 데이터베이스에서 모든 article을 가져온다.
    @articles = Article.paginate(page: params[:page], per_page: 5)