app/controllers/categories_controller.rb

SELECT  `categories`.* FROM `categories` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `categories`
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 5)