app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page], per_page: 5)

INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Jake', 'jeongho.kang@dramancompany.com', '2019-01-09 10:47:51', '2019-01-09 10:47:51', '$2a$10$gx9v367Lmr8M2JjNUxgosuX3xfG/odM6wF3WiGjeMZMxPBYl05OKi')
---
  def create
    @user = User.new(user_params) # UI로부터 받아온 이름, 이메일, 비밀번호를 받아서 인스턴스 생성
    if @user.save # 인스턴스를 DB에 저장

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @user = User.find(params[:id]) # 변경할 유저 아이디로 유저 retrieve.
    render 'edit' # edit 템플릿으로 보내면 바로 @user와 같이 전송되는것 같다.
  end

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 LIMIT 5 OFFSET 0
SELECT  `users`.* FROM `users` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 1
SELECT COUNT(*) FROM `users`
---
  def show
    @user = User.find(params[:id])
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)